import React from 'react';

const FAQs = () => {


    const faq = [
      {
        id: 1,
        title: "কোর্সটি কীভাবে কিনবো?",
        description: ` "কোর্সটি কিনুন" বাটনে ক্লিক করুন। আপনি যেই ফোন নম্বর বা ইমেইল দিয়ে
            কোর্সটি কিনতে চান সেটি প্রদান করে “এগিয়ে যান” বাটনে ক্লিক করুন।
            “প্রশ্ন-চিহ্ন” আইকনে ক্লিক করে পেমেন্ট করার নিয়মটি জেনে নিন। আপনার
            মোবাইল নাম্বার বা ইমেইল দিয়ে “কোর্সটি কিনুন” অপশনে ক্লিক করুন।
            পেমেন্ট মেথড নির্বাচন করুন। আপনাকে পেমেন্ট সেকশনে নিয়ে যাওয়া হবে
            যেখানে আপনার পেমেন্ট করতে পারবেন। পেমেন্ট সম্পন্ন করার পর আপনার
            একাউন্টে “আপনার কোর্সসমূহ” সেকশনে কোর্সটি চলে আসবে। `,
      },
      {
        id: 2,
        title: `ইনএক্টিভ একাউন্ট কিভাবে পুনরায় এক্টিভ করব/পাসওয়ার্ড ভুলে
            গিয়েছি/পাসওয়ার্ড কিভাবে পরিবর্তন করব?`,
        description: ` লগ-ইন করার সময় নিচে "Forget Password/পাসওয়ার্ড ভুলে গিয়েছি" নামে
            একটি অপশন পাবেন। সেটির মাধ্যমে আপনি পাসওয়ার্ড রিসেট করে নতুন
            পাসওয়ার্ড নিতে পারবেন। পাসওয়ার্ড রিসেট করার পরে আপনি পুনরায় নতুন
            পাসওয়ার্ড সেট করতে পারবেন। `,
      },
     
    ];


    return (
      <div>
        <h1 className="text-xl text-left font-bold my-6">
          আপনাদের সাধারণ প্রশ্নোত্তর
        </h1>
        {faq.map((pd) => (
          <div key={pd.id} className="border p-4 rounded-md mb-4">
            <h5 className="text-lg font-medium text-left  ">
              {pd.title}
            </h5>
            <br />
            <p className="text-left">
                {pd.description}
            </p>
          </div>
        ))}
      </div>
    );
};

export default FAQs;